## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `module.valentine_api_key.azurerm_cognitive_account.openai`                       |
|        | `module.valentine_api_key.azurerm_cognitive_deployment.deployment[&quot;openai-gpt4&quot;]` |
|        | `module.valentine_api_key.azurerm_resource_group.rg`                              |
|        | `module.valentine_api_key.random_string.azurerm_cognitive_account_name`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.valentine_api_key.azurerm_cognitive_account.openai will be created
  + resource "azurerm_cognitive_account" "openai" {
      + custom_subdomain_name              = (known after apply)
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "canadaeast"
      + name                               = (known after apply)
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.valentine_api_key.azurerm_cognitive_deployment.deployment["openai-gpt4"] will be created
  + resource "azurerm_cognitive_deployment" "deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "openai-gpt4"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4"
          + version = "0314"
        }

      + scale {
          + capacity = 1
          + type     = "Standard"
        }
    }

  # module.valentine_api_key.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadaeast"
      + name     = (known after apply)
    }

  # module.valentine_api_key.random_string.azurerm_cognitive_account_name will be created
  + resource "random_string" "azurerm_cognitive_account_name" {
      + id          = (known after apply)
      + length      = 7
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
